import Mock from 'mockjs'
const data1 = {'2019-10-01': {'军事': 55, '政治': 301, '娱乐': 1, '体育': 9, '社会': 42, '经济': 14, '其他': 130, 'sum': 552}, '2019-10-02': {'军事': 7, '政治': 178, '娱乐': 6, '体育': 7, '社会': 71, '经济': 23, '其他': 62, 'sum': 354}, '2019-10-03': {'军事': 14, '政治': 161, '娱乐': 3, '体育': 14, '社会': 66, '经济': 17, '其他': 58, 'sum': 333}, '2019-10-04': {'军事': 8, '政治': 152, '娱乐': 5, '体育': 14, '社会': 75, '经济': 30, '其他': 43, 'sum': 327}, '2019-10-05': {'军事': 1, '政治': 133, '娱乐': 2, '体育': 10, '社会': 100, '经济': 29, '其他': 60, 'sum': 335}, '2019-10-06': {'军事': 11, '政治': 136, '娱乐': 2, '体育': 20, '社会': 87, '经济': 34, '其他': 50, 'sum': 340}, '2019-10-07': {'军事': 3, '政治': 128, '娱乐': 2, '体育': 16, '社会': 106, '经济': 46, '其他': 58, 'sum': 359}, '2019-10-08': {'军事': 7, '政治': 299, '娱乐': 20, '体育': 35, '社会': 112, '经济': 139, '其他': 99, 'sum': 711}, '2019-10-09': {'军事': 6, '政治': 339, '娱乐': 16, '体育': 27, '社会': 143, '经济': 128, '其他': 96, 'sum': 755}, '2019-10-10': {'军事': 10, '政治': 316, '娱乐': 19, '体育': 43, '社会': 196, '经济': 122, '其他': 110, 'sum': 816}, '2019-10-11': {'军事': 5, '政治': 345, '娱乐': 17, '体育': 40, '社会': 165, '经济': 141, '其他': 104, 'sum': 817}, '2019-10-12': {'军事': 1, '政治': 285, '娱乐': 10, '体育': 34, '社会': 153, '经济': 115, '其他': 94, 'sum': 692}, '2019-10-13': {'军事': 7, '政治': 197, '娱乐': 5, '体育': 19, '社会': 82, '经济': 36, '其他': 70, 'sum': 416}, '2019-10-14': {'军事': 3, '政治': 320, '娱乐': 19, '体育': 32, '社会': 186, '经济': 115, '其他': 92, 'sum': 767}, '2019-10-15': {'军事': 14, '政治': 329, '娱乐': 14, '体育': 33, '社会': 209, '经济': 168, '其他': 111, 'sum': 878}, '2019-10-16': {'军事': 16, '政治': 385, '娱乐': 16, '体育': 37, '社会': 282, '经济': 152, '其他': 109, 'sum': 997}, '2019-10-17': {'军事': 29, '政治': 391, '娱乐': 18, '体育': 49, '社会': 244, '经济': 194, '其他': 108, 'sum': 1033}, '2019-10-18': {'军事': 38, '政治': 313, '娱乐': 29, '体育': 31, '社会': 209, '经济': 195, '其他': 127, 'sum': 942}, '2019-10-19': {'军事': 26, '政治': 156, '娱乐': 2, '体育': 38, '社会': 131, '经济': 87, '其他': 96, 'sum': 536}, '2019-10-20': {'军事': 18, '政治': 124, '娱乐': 1, '体育': 54, '社会': 103, '经济': 73, '其他': 100, 'sum': 473}, '2019-10-21': {'军事': 33, '政治': 316, '娱乐': 12, '体育': 38, '社会': 171, '经济': 162, '其他': 138, 'sum': 870}, '2019-10-22': {'军事': 26, '政治': 353, '娱乐': 15, '体育': 28, '社会': 206, '经济': 190, '其他': 114, 'sum': 932}, '2019-10-23': {'军事': 19, '政治': 319, '娱乐': 19, '体育': 29, '社会': 230, '经济': 132, '其他': 111, 'sum': 859}, '2019-10-24': {'军事': 4, '政治': 307, '娱乐': 14, '体育': 60, '社会': 226, '经济': 156, '其他': 101, 'sum': 868}, '2019-10-25': {'军事': 7, '政治': 342, '娱乐': 29, '体育': 31, '社会': 196, '经济': 173, '其他': 99, 'sum': 877}, '2019-10-26': {'军事': 11, '政治': 183, '娱乐': 6, '体育': 47, '社会': 118, '经济': 77, '其他': 45, 'sum': 487}, '2019-10-27': {'军事': 2, '政治': 161, '娱乐': 2, '体育': 57, '社会': 81, '经济': 49, '其他': 68, 'sum': 420}, '2019-10-28': {'军事': 7, '政治': 294, '娱乐': 17, '体育': 44, '社会': 179, '经济': 125, '其他': 81, 'sum': 747}, '2019-10-29': {'军事': 8, '政治': 371, '娱乐': 15, '体育': 34, '社会': 248, '经济': 132, '其他': 93, 'sum': 901}, '2019-10-30': {'军事': 3, '政治': 343, '娱乐': 17, '体育': 32, '社会': 261, '经济': 161, '其他': 99, 'sum': 916}, '2019-10-31': {'军事': 13, '政治': 334, '娱乐': 11, '体育': 33, '社会': 223, '经济': 187, '其他': 98, 'sum': 899}}
const data2 = {'2019-10-01': 117, '2019-10-02': 55, '2019-10-03': 52, '2019-10-04': 65, '2019-10-05': 70, '2019-10-06': 62, '2019-10-07': 65, '2019-10-08': 141, '2019-10-09': 147, '2019-10-10': 155, '2019-10-11': 147, '2019-10-12': 133, '2019-10-13': 71, '2019-10-14': 158, '2019-10-15': 177, '2019-10-16': 188, '2019-10-17': 194, '2019-10-18': 214, '2019-10-19': 118, '2019-10-20': 109, '2019-10-21': 179, '2019-10-22': 154, '2019-10-23': 187, '2019-10-24': 182, '2019-10-25': 180, '2019-10-26': 99, '2019-10-27': 92, '2019-10-28': 159, '2019-10-29': 193, '2019-10-30': 181, '2019-10-31': 197}
var politic = {}
var military ={}
var economic = {}
var sports  = {}
var others = {}
var socity = {}
var entertain = {}
var sum = {}
var sampled = {}
var ret = []
for(var date in data1)
{
    politic[date] = data1[date]['政治']
    military[date] = data1[date]['军事']
    economic[date] = data1[date]['经济']
    sports[date] = data1[date]['体育']
    others[date] = data1[date]['其他']
    socity[date] = data1[date]['社会']
    entertain[date] = data1[date]['娱乐']
    sum[date] = data1[date]['sum']
    sampled[date] = data2[date]

}
for(var date in data1)
{
var toappend = {}
 toappend['date'] = date
 toappend['sampled'] = sampled[date]
 toappend['politic'] = politic[date]
 toappend['military'] = military[date]
 toappend['economic'] = economic[date]
 toappend['sports'] = sports[date]
 toappend['others'] = others[date]
 toappend['socity'] = socity[date]
 toappend['entertain'] = entertain[date]
 toappend['sum'] = sum[date]
ret.push(toappend)
 }
 
 console.log(ret)
 const reee = {'items':ret}
const mockdata = Mock.mock(reee)

export default [
    {
      url: '/chart/daychart',
      type: 'get',
      response: config => {
        const items = mockdata.items
        return {
          code: 20000,
          data: {
            total: items.length,
            items: items
          }
        }
      }
    }
  ]